configuration/InformationRegisters/_ИсточникиФункциональныхРолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_ИсточникиФункциональныхРолей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФункциональнаяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРеквизита</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРеквизитаДополнение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Catalogs/_Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>_Команды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._КомандыГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарточки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыКарточек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФункциональнаяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ФункциональныеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособГруппировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef._СпособыГруппировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/InformationRegisters/_ИсточникиФункциональныхРолей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Истина = ЭтаФорма.Заголовок Тогда
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Владелец_Форма = Неопределено;
	Владелец_Список = Неопределено;
	Владелец_Поле = Неопределено;
	_НаКлиенте.ОпределитьВладельцаФормы(ЭтаФорма.ВладелецФормы,Владелец_Форма,Владелец_Список,Владелец_Поле);
	
	Если 
	   ( Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._ВидыКарточек.Форма.ФормаЭлемента"
	   И Владелец_Список <> Неопределено И Владелец_Список.Имя = "ИсточникиФункциональныхРолей" 
	   И Владелец_Форма[Владелец_Список.Имя].Параметры.Элементы.Количество() > 0
	   )
	ИЛИ   
	   ( Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._Команды.Форма.ФормаЭлемента"
	   И Владелец_Список <> Неопределено И Владелец_Список.Имя = "ИсточникиФункциональныхРолей" 
	   И Владелец_Форма[Владелец_Список.Имя].Параметры.Элементы.Количество() > 0
	   )
	Тогда
		Для Каждого ПараметрОтбора из Владелец_Форма[Владелец_Список.Имя].Параметры.Элементы Цикл
		    ИмяПараметра = ""+ПараметрОтбора.Параметр;
			Если ИмяПараметра = "ВидКарточки"
			 ИЛИ ИмяПараметра = "Команда" 
			Тогда
				ЭтаФорма.Запись[ИмяПараметра] = ПараметрОтбора.Значение;
				ЭтаФорма.Элементы[ИмяПараметра].ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._ВидыКарточек.Форма.ФормаЭлемента" Тогда
			ЭтаФорма.Запись["Команда"] = Владелец_Форма.Элементы.Команды.ТекущиеДанные.Команда;
		КонецЕсли;
		Если Владелец_Форма <> Неопределено И Владелец_Форма.ИмяФормы = "Справочник._Команды.Форма.ФормаЭлемента" Тогда
			БазоваяФункциональнаяРоль = ПредопределенноеЗначение("Справочник._ФункциональныеРоли.ОсновнаяФР");
			Для каждого ИндефикаторВыделеннойСтроки ИЗ Владелец_Форма.Элементы.ФункциональныеРоли.ВыделенныеСтроки Цикл
				ВыделеннаяСтрока = Владелец_Форма.Элементы.ФункциональныеРоли.ДанныеСтроки(ИндефикаторВыделеннойСтроки);
				Если ВыделеннаяСтрока.ФункциональнаяРоль = БазоваяФункциональнаяРоль Тогда
					ЭтаФорма.Запись["ВидКарточки"] = ВыделеннаяСтрока.ВидКарточки;
				Иначе
					ЭтаФорма.Запись["ФункциональнаяРоль"] = ВыделеннаяСтрока.ФункциональнаяРоль;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
